# Importação de arquivos excel com pandas

1. Importe, utilizando o pacote pandas, o arquivo **datasets/battledeath.xlsx** e imprima o nome das planilhas contidas neste arquivo que contêm as taxas de mortalidade ajustadas por idade devido à guerra em vários países ao longo de vários anos.

In [1]:
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
arquivo = 'datasets/battledeath.xlsx'
pasta   = pd.ExcelFile(arquivo)

In [3]:
pasta.sheet_names

['2002', '2004']

2. Leia a planilha '2002' e armazene o conteúdo do dataframe **df_2002**. Exiba as primeiras linhas do dataframe.

In [9]:
df_2002 = pasta.parse('2002')

In [10]:
df_2002.head()

  War, age-adjusted mortality due to       2002
0                        Afghanistan  36.083990
1                            Albania   0.128908
2                            Algeria  18.314120
3                            Andorra   0.000000
4                             Angola  18.964560

3. Leia a planilha '2004' e armazene o conteúdo do dataframe **df_2004**. Exiba as primeiras linhas do dataframe.

In [4]:
df_2004 = pasta.parse('2004')

In [5]:
df_2004.head()

  War(country)      2004
0  Afghanistan  9.451028
1      Albania  0.130354
2      Algeria  3.407277
3      Andorra  0.000000
4       Angola  2.597931

4. Leia as planilhas anteriores saltando a primeira linha (skirows=[1]) e renomeando as colunas para "Pais e Idade Ajustada (2002 ou 2004)" (names=["Pais", "Mortalidade Ajustada (2002 ou 2004"]). Utilize a posição da planilha ao invés do nome.

In [6]:
df_2002 = pasta.parse(0, skiprows=[1], names=['Pais', 'Mortalidade Ajustada (2002)'])
df_2002.head()

                  Pais  Mortalidade Ajustada (2002)
0              Albania                     0.128908
1              Algeria                    18.314120
2              Andorra                     0.000000
3               Angola                    18.964560
4  Antigua and Barbuda                     0.000000

In [8]:
df_2004 = pasta.parse(1, skiprows=[1], names=['Pais', 'Mortalidade Ajustada (2004)'])
df_2004.head()

                  Pais  Mortalidade Ajustada (2004)
0              Albania                     0.130354
1              Algeria                     3.407277
2              Andorra                     0.000000
3               Angola                     2.597931
4  Antigua and Barbuda                     0.000000